Revit 2026 API

# TableCellStyleTextColor Property

---

The text color of this cell.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Color TextColor { get; set; }
```
```vb
Public Property TextColor As Color
	Get
	Set
```
```cpp
public:
property Color^ TextColor {
	Color^ get ();
	void set (Color^ value);
}
```
```fsharp
member TextColor : Color with get, set
```

#### Property Value

Color

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

TableCellStyle Class

Autodesk.Revit.DB Namespace